{
  "backend/main.mo": "Main Motoko actor implementing salon booking system with user profiles, salon management, services, bookings, reviews, and admin functions with role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (authentication, salon profiles, service management, time slots, bookings, discovery, reviews, admin) to their corresponding files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including pages, components, hooks, and configuration with descriptions of their functionality and purpose.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables using neutral tones for backgrounds, foregrounds, borders, and semantic colors.",
  "frontend/index.html": "HTML entry point for the Baitoo application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router configuration, route definitions for all pages, authentication guards, loading states, and ProfileSetupModal integration.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with loading states, error handling, and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup with form fields for name, phone number, and user type selection (customer or salon owner) with validation.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component that renders a sticky header with logo and login button, main content area, mobile navigation for authenticated users, and a footer with attribution link.",
  "frontend/src/components/layout/MobileNav.tsx": "Bottom navigation bar for mobile devices that displays different navigation links based on user type (customer, salon owner, or admin) with active state highlighting.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication that manages login state, identity persistence, and provides login/logout functionality using the DFINITY auth client.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, salons, services, bookings, and reviews with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-toned color scheme for both light and dark modes suitable for a salon booking application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page with tabs for managing salons and users, including permission checks and delete functionality with confirmation dialogs.",
  "frontend/src/pages/BookingConfirmationPage.tsx": "Booking confirmation page that displays booking details with salon and service information, and provides navigation buttons to view bookings or browse salons.",
  "frontend/src/pages/BookingPage.tsx": "Booking form page where customers select a service and time slot to book an appointment at a specific salon, then navigates to confirmation on success.",
  "frontend/src/pages/CustomerBookingsPage.tsx": "Displays a customer's list of bookings with details and status badges; includes a dialog for submitting reviews on completed appointments.",
  "frontend/src/pages/SalonBookingsDashboard.tsx": "Dashboard for salon owners to view all their bookings with customer details and mark pending bookings as completed.",
  "frontend/src/pages/SalonDetailPage.tsx": "Shows detailed information about a specific salon including services, reviews with star ratings, contact info, and a button to book appointments.",
  "frontend/src/pages/SalonDiscoveryPage.tsx": "Lists all available salons in Faizabad with basic info (address, phone, hours) and navigation to individual salon detail pages.",
  "frontend/src/pages/SalonProfilePage.tsx": "Form for salon owners to create or update their business profile including name, address, contact number, and opening hours.",
  "frontend/src/pages/ServiceManagementPage.tsx": "Service management page for salon owners to view, add, and edit services with name and price fields. Includes a dialog component for creating/updating services and displays them in a card list.",
  "frontend/src/pages/TimeSlotManagementPage.tsx": "Time slot management page for salon owners to add, remove, and save available appointment time slots. Features an input field for adding slots and a list view with remove buttons.",
  "frontend/src/pages/WelcomePage.tsx": "Landing page that redirects authenticated users based on their role (customer to salons, salon owner to profile) and displays hero banner with feature highlights for unauthenticated visitors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, container settings, border radius variables, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata defining Baitoo as a salon booking app for Faizabad, India with two user roles (salon owners and customers), architectural notes, and a list of implemented features including authentication, profile management, booking system, and reviews."
}