{
  "backend/main.mo": "Main backend actor implementing salon booking system with user profiles, salons, bookings, reviews, notifications, and access control using mixins for authorization and blob storage.",
  "backend/migration.mo": "Migration module that transforms old user profiles and reviews to new schema by adding optional profilePhoto and photo fields respectively.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including profile management, navigation improvements, salon/customer profile pages, and review functionality with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration files for the salon booking application.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark themes with warm earth tones suitable for salon booking interface.",
  "frontend/index.html": "HTML entry point for the Baitoo application with root div and module script reference to main.tsx.",
  "frontend/public/service-worker.js": "Service worker handling push notifications for bookings with notification display, click handling, client messaging, and sound/vibration support.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, authentication flow, profile setup modal, push notifications initialization, and route definitions for all customer, salon owner, and admin pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component that uses Internet Identity for authentication, handles login state, and clears query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for new user profile setup that collects name, phone number, and user type (customer or salon_owner), then redirects based on selection.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout wrapper with sticky header containing logo, profile button, notifications, and login button, plus mobile navigation and footer.",
  "frontend/src/components/layout/MobileNav.tsx": "Bottom navigation bar for mobile devices that displays different menu items based on user type (customer vs salon_owner) and admin status.",
  "frontend/src/components/notifications/BookingNotificationCard.tsx": "Card component displaying booking request details with confirm/cancel actions for salon owners, including customer info, service, and time slot.",
  "frontend/src/components/notifications/NotificationBell.tsx": "Bell icon with badge showing pending booking notifications for salon owners, opens popover with scrollable list of notification cards.",
  "frontend/src/components/shared/ImageUploadField.tsx": "Image upload component supporting both file selection from gallery and camera capture, with preview and remove functionality.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCustomerNotifications.ts": "Polls for customer notifications every 10 seconds, displays toast notifications for booking confirmations/cancellations, and marks them as delivered to prevent duplicates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using DFINITY's AuthClient.",
  "frontend/src/hooks/usePushNotifications.ts": "Requests browser notification permissions and registers a service worker for push notifications when a user is authenticated.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, salons, services, bookings, reviews, and notifications with automatic cache invalidation.",
  "frontend/src/hooks/useReminderChecker.ts": "Polls every 60 seconds for pending bookings requiring reminders for salon owners and sends browser notifications via service worker.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark themes using warm earth tones suitable for a salon application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays and manages all salons and users with delete functionality, protected by admin permission checks.",
  "frontend/src/pages/BookingConfirmationPage.tsx": "Booking confirmation page that displays successful booking details with navigation options to view bookings or browse more salons.",
  "frontend/src/pages/BookingPage.tsx": "Appointment booking page where customers select a service and time slot for a specific salon and submit the booking.",
  "frontend/src/pages/CustomerBookingsPage.tsx": "Customer bookings list page displaying all user bookings with status badges and review submission functionality for completed bookings.",
  "frontend/src/pages/CustomerProfilePage.tsx": "Customer profile management page allowing users to update their name, phone number, and profile photo with booking statistics display.",
  "frontend/src/pages/SalonBookingsDashboard.tsx": "Salon owner dashboard displaying all bookings for their salon with ability to mark bookings as complete and view customer details.",
  "frontend/src/pages/SalonDetailPage.tsx": "Displays detailed information about a specific salon including services, reviews, and ratings, with a booking dialog for customers to select services, time slots, and dates.",
  "frontend/src/pages/SalonDiscoveryPage.tsx": "Lists all available salons in Faizabad with basic information (name, address, contact, hours) and navigation to individual salon detail pages.",
  "frontend/src/pages/SalonProfilePage.tsx": "Allows salon owners to create and edit their business profile including name, address, contact number, opening hours, and profile photo upload.",
  "frontend/src/pages/SalonReviewsPage.tsx": "Displays all customer reviews for a salon with ratings, comments, photos, and timestamps, sorted by newest first.",
  "frontend/src/pages/ServiceManagementPage.tsx": "Enables salon owners to add, edit, and manage their service offerings with names and prices through a dialog interface.",
  "frontend/src/pages/TimeSlotManagementPage.tsx": "Allows salon owners to create and manage available booking time slots by adding or removing time entries.",
  "frontend/src/pages/WelcomePage.tsx": "Landing page component that displays hero banner and feature cards (Find Salons, Book Appointments, Leave Reviews), redirecting authenticated users to appropriate dashboards based on their user type (customer or salon_owner).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, and animation keyframes for accordion components with typography and container query plugins.",
  "project_state.json": "Project metadata for Baitoo salon booking app targeting Faizabad, India, defining two-sided marketplace architecture with salon owners and customers, phone authentication, booking management, and admin panel features for MVP supporting 10-20 salons."
}