{
  "backend/main.mo": "Main actor defining the salon booking system with user profiles, salons, bookings, reviews, and notifications. Includes authorization mixins, blob storage, and migration support with CRUD operations for all entities.",
  "backend/migration.mo": "Migration module that transforms old salon data to new schema by adding latitude and longitude fields (initialized to null) while preserving all other data structures.",
  "feature_evidence.json": "Feature evidence report documenting GPS location features including admin location input, customer location permission, distance calculation with Haversine formula, distance display, and salon sorting by proximity.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities with focus on GPS location features, booking flow, reviews, and admin dashboard enhancements.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system using warm earth tones for light and dark themes, including sidebar and chart color variables.",
  "frontend/index.html": "HTML entry point for the Baitoo application with viewport meta tag and root div for React mounting.",
  "frontend/public/service-worker.js": "Service worker handling push notifications with sound, vibration, notification display, click handling to focus/open app windows, and message passing between worker and main app.",
  "frontend/src/App.tsx": "Main application entry point that sets up TanStack Router with routes for all pages (salon discovery, booking, profiles, admin, etc.) and initializes authentication, push notifications, reminders, and profile setup modal.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component that toggles between login/logout states using Internet Identity, handles authentication errors, and clears the query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup that collects name, phone number, and user type (customer or salon owner), then redirects to appropriate page after saving.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper component providing header with logo/login/notifications, footer with attribution, and conditional mobile navigation based on user authentication and profile type.",
  "frontend/src/components/layout/MobileNav.tsx": "Bottom navigation bar for mobile devices that displays role-specific links (customer vs salon owner) with active state highlighting and optional admin link.",
  "frontend/src/components/notifications/BookingNotificationCard.tsx": "Card component displaying pending booking details with customer info and service details, providing confirm/cancel actions with cancellation reason dialog for salon owners.",
  "frontend/src/components/notifications/NotificationBell.tsx": "Bell icon with badge counter for salon owners showing pending booking notifications in a popover, marking notifications as delivered when opened and refreshing on action completion.",
  "frontend/src/components/shared/ImageUploadField.tsx": "React component providing image upload functionality with camera capture and gallery selection options, including preview and removal capabilities.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, initializing it with Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCustomerNotifications.ts": "Hook that polls for customer notifications (booking confirmations/cancellations) every 10 seconds and displays toast notifications, marking them as delivered after display.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing identity state and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/usePushNotifications.ts": "Hook that requests browser notification permissions and registers a service worker for push notifications when a user is authenticated.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, salons, services, bookings, reviews, and notifications with automatic cache invalidation.",
  "frontend/src/hooks/useReminderChecker.ts": "Hook for salon owners that checks pending bookings every 60 seconds and sends browser notifications via service worker for bookings requiring action.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using warm earth tones suitable for a salon application.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider and InternetIdentity authentication wrapper around the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabs for managing salons and users, including delete operations and salon location updates with coordinate validation.",
  "frontend/src/pages/BookingConfirmationPage.tsx": "Booking confirmation page that displays booking details with salon and service information, providing navigation to bookings list or salon browsing.",
  "frontend/src/pages/BookingPage.tsx": "Appointment booking form page where users select a service and time slot for a specific salon, then submit to create a booking.",
  "frontend/src/pages/CustomerBookingsPage.tsx": "Customer bookings list page displaying all user bookings with status badges, service details, and review submission functionality with image upload.",
  "frontend/src/pages/CustomerProfilePage.tsx": "Customer profile management page allowing users to update their name, phone number, and profile photo with image upload support.",
  "frontend/src/pages/SalonBookingsDashboard.tsx": "Salon owner dashboard displaying all bookings for their salon with customer details, service info, and ability to mark bookings as complete.",
  "frontend/src/pages/SalonDetailPage.tsx": "Displays detailed information about a specific salon including services, reviews, ratings, and contact details. Provides booking functionality with service selection, time slot picker, and review submission with photo upload.",
  "frontend/src/pages/SalonDiscoveryPage.tsx": "Shows a list of salons sorted by proximity to user's location using geolocation API. Displays distance, contact info, and navigation options for each salon with fallback to default ordering if location permission is denied.",
  "frontend/src/pages/SalonProfilePage.tsx": "Allows salon owners to create and edit their business profile including name, address, contact number, opening hours, and profile photo upload. Integrates with Internet Identity for authentication.",
  "frontend/src/pages/SalonReviewsPage.tsx": "Displays all customer reviews for a salon owner's business, showing ratings, comments, photos, and timestamps sorted by newest first. Includes expandable image dialog for review photos.",
  "frontend/src/pages/ServiceManagementPage.tsx": "Enables salon owners to add, edit, and manage their service offerings with name and price fields. Uses a dialog-based form for creating and updating services.",
  "frontend/src/pages/TimeSlotManagementPage.tsx": "Allows salon owners to define and manage available booking time slots by adding or removing time entries. Provides a simple interface to save the complete list of time slots.",
  "frontend/src/pages/WelcomePage.tsx": "Landing page component that displays hero banner and feature cards (Find Salons, Book Appointments, Leave Reviews), with automatic navigation based on user type (customer to /salons, salon_owner to /salon-profile).",
  "frontend/src/utils/distance.ts": "Utility function that calculates distance between two GPS coordinates using the Haversine formula, returning distance in kilometers rounded to one decimal place.",
  "frontend/src/utils/urlParams.ts": "URL parameter management utilities supporting both hash-based and browser routing, with functions to extract, persist, and clear parameters from URLs and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), container settings, border radius variables, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata for Baitoo salon booking app defining architecture (two-sided marketplace for salon owners and customers), existing features (authentication, profiles, bookings, reviews), and technical requirements (phone auth, location-based discovery, push notifications)."
}