{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add GPS-based nearby salon discovery with location management",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Add location input fields (latitude and longitude) to the AdminDashboard for each salon with a save button to update salon coordinates",
      "acceptanceCriteria": [
        "Admin panel displays latitude and longitude input fields for each salon",
        "Input fields show current coordinates if already set",
        "Save button calls updateSalonLocation backend function",
        "Success/error feedback is displayed after save attempt"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add latitude and longitude input fields to each salon row in the salons table. Display current coordinates if available. Add a save button next to each salon that calls the updateSalonLocation backend function with the salon ID and entered coordinates. Display success or error toast messages after the save attempt. Ensure inputs accept decimal numbers and validate coordinate ranges (latitude: -90 to 90, longitude: -180 to 180)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useUpdateSalonLocation mutation hook that calls actor.updateSalonLocation(salonId, latitude, longitude) and invalidates the 'allSalons' query cache on success. Include error handling and return mutation status for UI feedback."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Implement GPS location permission request flow in SalonDiscoveryPage that asks for user's current location when the page loads",
      "acceptanceCriteria": [
        "Browser geolocation API permission is requested on page load",
        "Permission state (granted/denied) is tracked",
        "User's latitude and longitude are retrieved if permission is granted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SalonDiscoveryPage.tsx",
          "operation": "modify",
          "description": "Add useEffect hook that runs on component mount to request geolocation permission using navigator.geolocation.getCurrentPosition(). Store the user's current latitude and longitude in component state. Track permission state (granted/denied/unavailable) in component state. Handle permission denial gracefully without blocking the page. Display appropriate UI feedback during location retrieval (e.g., loading indicator)."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Add distance calculation utility function that computes the distance in kilometers between two GPS coordinates using the Haversine formula",
      "acceptanceCriteria": [
        "Function accepts two coordinate pairs (lat1, lon1, lat2, lon2)",
        "Returns distance in kilometers with one decimal place precision",
        "Handles edge cases (same location returns 0 km)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/distance.ts",
          "operation": "create",
          "description": "Create a utility function calculateDistance(lat1: number, lon1: number, lat2: number, lon2: number): number that implements the Haversine formula to calculate the great-circle distance between two GPS coordinate pairs. Return the distance in kilometers rounded to one decimal place. Handle edge cases where coordinates are identical (return 0). Export the function for use in other components."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Update SalonDiscoveryPage to calculate and display distance from customer's current location to each salon that has GPS coordinates, showing the distance in the format '1.5 km away'",
      "acceptanceCriteria": [
        "Distance is displayed next to each salon that has coordinates",
        "Distance format matches '1.5 km away' pattern",
        "Salons without coordinates do not show distance"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SalonDiscoveryPage.tsx",
          "operation": "modify",
          "description": "Import the calculateDistance utility from frontend/src/utils/distance.ts. For each salon in the list, check if both the user's current location and the salon's latitude/longitude are available. If both exist, calculate the distance using calculateDistance and display it next to the salon information in the format 'X.X km away'. Only display distance for salons that have coordinates. Ensure the distance text is visually clear and positioned appropriately within each salon card."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Update SalonDiscoveryPage to sort salons by distance from customer's location, placing nearest salons first when location permission is granted",
      "acceptanceCriteria": [
        "When location permission is granted, salons are sorted by ascending distance",
        "Salons without coordinates appear after salons with coordinates",
        "When location permission is denied, original salon order is preserved"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SalonDiscoveryPage.tsx",
          "operation": "modify",
          "description": "Add sorting logic that runs after salons are fetched and user location is available. If location permission is granted and user coordinates exist, sort the salons array by calculated distance in ascending order. Place salons with coordinates first (sorted by distance), followed by salons without coordinates (in their original order). If location permission is denied or unavailable, preserve the original salon order returned from the backend. Ensure sorting updates reactively when location state changes."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Update SalonDiscoveryPage heading text to dynamically display 'Nearby You' when location permission is granted, or 'Salons in Faizabad' when permission is denied or not available",
      "acceptanceCriteria": [
        "Heading displays 'Nearby You' when GPS permission is granted",
        "Heading displays 'Salons in Faizabad' when GPS permission is denied or unavailable",
        "Heading updates immediately after permission state changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SalonDiscoveryPage.tsx",
          "operation": "modify",
          "description": "Update the page heading to dynamically render based on the location permission state. Display 'Nearby You' when location permission is granted and user coordinates are successfully retrieved. Display 'Salons in Faizabad' when location permission is denied, unavailable, or not yet determined. Ensure the heading updates reactively when the permission state changes."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Add a notice text 'Please reach the salon at least 10 minutes before your booking time.' below the booking confirmation button on the BookingPage",
      "acceptanceCriteria": [
        "Notice text appears directly below the booking button",
        "Text is clearly visible and styled appropriately",
        "Text reads exactly: 'Please reach the salon at least 10 minutes before your booking time.'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BookingPage.tsx",
          "operation": "modify",
          "description": "Add a text element directly below the booking confirmation button that displays the exact message: 'Please reach the salon at least 10 minutes before your booking time.' Style the text to be clearly visible using appropriate typography classes (e.g., text-sm, text-muted-foreground) to ensure it stands out as an informational notice without overpowering the primary booking action."
        }
      ]
    }
  ]
}